{"modelTopology":{"class_name":"Model","config":{"name":"model5","layers":[{"name":"input7","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input7"},"inbound_nodes":[]},{"name":"dense_Dense19","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense19","trainable":true},"inbound_nodes":[[["input7",0,0,{}]]]},{"name":"input8","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input8"},"inbound_nodes":[]},{"name":"dense_Dense20","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense20","trainable":true},"inbound_nodes":[[["dense_Dense19",0,0,{}]]]},{"name":"dense_Dense21","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense21","trainable":true},"inbound_nodes":[[["input8",0,0,{}]]]},{"name":"concatenate_Concatenate3","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate3","trainable":true},"inbound_nodes":[[["dense_Dense20",0,0,{}],["dense_Dense21",0,0,{}]]]},{"name":"dense_Dense22","class_name":"Dense","config":{"units":512,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22","trainable":true},"inbound_nodes":[[["concatenate_Concatenate3",0,0,{}]]]},{"name":"dense_Dense23","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense23","trainable":true},"inbound_nodes":[[["dense_Dense22",0,0,{}]]]},{"name":"dense_Dense24","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense24","trainable":true},"inbound_nodes":[[["dense_Dense23",0,0,{}]]]}],"input_layers":[["input7",0,0],["input8",0,0]],"output_layers":[["dense_Dense24",0,0]]},"keras_version":"tfjs-layers 4.20.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.20.0","convertedBy":null,"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense19/kernel","shape":[3,256],"dtype":"float32"},{"name":"dense_Dense19/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense20/kernel","shape":[256,128],"dtype":"float32"},{"name":"dense_Dense20/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense21/kernel","shape":[1,256],"dtype":"float32"},{"name":"dense_Dense21/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense22/kernel","shape":[384,512],"dtype":"float32"},{"name":"dense_Dense22/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense23/kernel","shape":[512,128],"dtype":"float32"},{"name":"dense_Dense23/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense24/kernel","shape":[128,1],"dtype":"float32"},{"name":"dense_Dense24/bias","shape":[1],"dtype":"float32"}]}]}