{"modelTopology":{"class_name":"Model","config":{"name":"model2","layers":[{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,96,96,3],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"separable_conv2d_SeparableConv2D3","class_name":"SeparableConv2D","config":{"filters":32,"kernel_size":[5,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D3","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"p_re_lu_PReLU5","class_name":"PReLU","config":{"alpha_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"alpha_regularizer":null,"alpha_constraint":null,"shared_axes":null,"name":"p_re_lu_PReLU5","trainable":true},"inbound_nodes":[[["separable_conv2d_SeparableConv2D3",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D3","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D3","trainable":true},"inbound_nodes":[[["p_re_lu_PReLU5",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization5","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization5","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D3",0,0,{}]]]},{"name":"separable_conv2d_SeparableConv2D4","class_name":"SeparableConv2D","config":{"filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D4","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null},"inbound_nodes":[[["batch_normalization_BatchNormalization5",0,0,{}]]]},{"name":"p_re_lu_PReLU6","class_name":"PReLU","config":{"alpha_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"alpha_regularizer":null,"alpha_constraint":null,"shared_axes":null,"name":"p_re_lu_PReLU6","trainable":true},"inbound_nodes":[[["separable_conv2d_SeparableConv2D4",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D4","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D4","trainable":true},"inbound_nodes":[[["p_re_lu_PReLU6",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization6","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization6","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D4",0,0,{}]]]},{"name":"flatten_Flatten2","class_name":"Flatten","config":{"name":"flatten_Flatten2","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization6",0,0,{}]]]},{"name":"dense_Dense4","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true},"inbound_nodes":[[["flatten_Flatten2",0,0,{}]]]},{"name":"p_re_lu_PReLU7","class_name":"PReLU","config":{"alpha_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"alpha_regularizer":null,"alpha_constraint":null,"shared_axes":null,"name":"p_re_lu_PReLU7","trainable":true},"inbound_nodes":[[["dense_Dense4",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization7","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization7","trainable":true},"inbound_nodes":[[["p_re_lu_PReLU7",0,0,{}]]]},{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"dense_Dense5","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization7",0,0,{}]]]},{"name":"dense_Dense6","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true},"inbound_nodes":[[["input3",0,0,{}]]]},{"name":"p_re_lu_PReLU8","class_name":"PReLU","config":{"alpha_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"alpha_regularizer":null,"alpha_constraint":null,"shared_axes":null,"name":"p_re_lu_PReLU8","trainable":true},"inbound_nodes":[[["dense_Dense5",0,0,{}]]]},{"name":"p_re_lu_PReLU9","class_name":"PReLU","config":{"alpha_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"alpha_regularizer":null,"alpha_constraint":null,"shared_axes":null,"name":"p_re_lu_PReLU9","trainable":true},"inbound_nodes":[[["dense_Dense6",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization8","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization8","trainable":true},"inbound_nodes":[[["p_re_lu_PReLU8",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization9","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization9","trainable":true},"inbound_nodes":[[["p_re_lu_PReLU9",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization8",0,0,{}],["batch_normalization_BatchNormalization9",0,0,{}]]]},{"name":"dense_Dense7","class_name":"Dense","config":{"units":256,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"p_re_lu_PReLU10","class_name":"PReLU","config":{"alpha_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"alpha_regularizer":null,"alpha_constraint":null,"shared_axes":null,"name":"p_re_lu_PReLU10","trainable":true},"inbound_nodes":[[["dense_Dense7",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization10","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization10","trainable":true},"inbound_nodes":[[["p_re_lu_PReLU10",0,0,{}]]]},{"name":"dense_Dense8","class_name":"Dense","config":{"units":256,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization10",0,0,{}]]]},{"name":"p_re_lu_PReLU11","class_name":"PReLU","config":{"alpha_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"alpha_regularizer":null,"alpha_constraint":null,"shared_axes":null,"name":"p_re_lu_PReLU11","trainable":true},"inbound_nodes":[[["dense_Dense8",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization11","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization11","trainable":true},"inbound_nodes":[[["p_re_lu_PReLU11",0,0,{}]]]},{"name":"dense_Dense9","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense9","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization11",0,0,{}]]]}],"input_layers":[["input2",0,0],["input3",0,0]],"output_layers":[["dense_Dense9",0,0]]},"keras_version":"tfjs-layers 4.20.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.20.0","convertedBy":null,"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"separable_conv2d_SeparableConv2D3/depthwise_kernel","shape":[5,5,3,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D3/pointwise_kernel","shape":[1,1,3,32],"dtype":"float32"},{"name":"p_re_lu_PReLU5/alpha","shape":[96,96,32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/beta","shape":[32],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D4/depthwise_kernel","shape":[3,3,32,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D4/pointwise_kernel","shape":[1,1,32,64],"dtype":"float32"},{"name":"p_re_lu_PReLU6/alpha","shape":[48,48,64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[36864,64],"dtype":"float32"},{"name":"p_re_lu_PReLU7/alpha","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[3,64],"dtype":"float32"},{"name":"p_re_lu_PReLU8/alpha","shape":[32],"dtype":"float32"},{"name":"p_re_lu_PReLU9/alpha","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/beta","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense7/kernel","shape":[96,256],"dtype":"float32"},{"name":"p_re_lu_PReLU10/alpha","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/beta","shape":[256],"dtype":"float32"},{"name":"dense_Dense8/kernel","shape":[256,256],"dtype":"float32"},{"name":"p_re_lu_PReLU11/alpha","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/beta","shape":[256],"dtype":"float32"},{"name":"dense_Dense9/kernel","shape":[256,1],"dtype":"float32"},{"name":"dense_Dense9/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/moving_variance","shape":[256],"dtype":"float32"}]}]}