{"modelTopology":{"class_name":"Model","config":{"name":"model2","layers":[{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"dense_Dense4","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU3","class_name":"LeakyReLU","config":{"alpha":0.2,"name":"leaky_re_lu_LeakyReLU3","trainable":true},"inbound_nodes":[[["dense_Dense4",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization3","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU3",0,0,{}]]]},{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"dense_Dense5","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization3",0,0,{}]]]},{"name":"dense_Dense6","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true},"inbound_nodes":[[["input3",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU4","class_name":"LeakyReLU","config":{"alpha":0.2,"name":"leaky_re_lu_LeakyReLU4","trainable":true},"inbound_nodes":[[["dense_Dense5",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU5","class_name":"LeakyReLU","config":{"alpha":0.2,"name":"leaky_re_lu_LeakyReLU5","trainable":true},"inbound_nodes":[[["dense_Dense6",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization4","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization4","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU4",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization5","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization5","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU5",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization4",0,0,{}],["batch_normalization_BatchNormalization5",0,0,{}]]]},{"name":"dense_Dense7","class_name":"Dense","config":{"units":256,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU6","class_name":"LeakyReLU","config":{"alpha":0.2,"name":"leaky_re_lu_LeakyReLU6","trainable":true},"inbound_nodes":[[["dense_Dense7",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization6","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization6","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU6",0,0,{}]]]},{"name":"dense_Dense8","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization6",0,0,{}]]]},{"name":"activation_Activation1","class_name":"Activation","config":{"activation":"tanh","name":"activation_Activation1","trainable":true},"inbound_nodes":[[["dense_Dense8",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization7","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization7","trainable":true},"inbound_nodes":[[["activation_Activation1",0,0,{}]]]},{"name":"dense_Dense9","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense9","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization7",0,0,{}]]]}],"input_layers":[["input2",0,0],["input3",0,0]],"output_layers":[["dense_Dense9",0,0]]},"keras_version":"tfjs-layers 4.20.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.20.0","convertedBy":null,"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense4/kernel","shape":[3,128],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[1,128],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/beta","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense7/kernel","shape":[192,256],"dtype":"float32"},{"name":"dense_Dense7/bias","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/beta","shape":[256],"dtype":"float32"},{"name":"dense_Dense8/kernel","shape":[256,64],"dtype":"float32"},{"name":"dense_Dense8/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense9/kernel","shape":[64,1],"dtype":"float32"},{"name":"dense_Dense9/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/moving_variance","shape":[64],"dtype":"float32"}]}]}