{"modelTopology":{"class_name":"Model","config":{"name":"model4","layers":[{"name":"input5","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input5"},"inbound_nodes":[]},{"name":"dense_Dense13","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true},"inbound_nodes":[[["input5",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU9","class_name":"LeakyReLU","config":{"alpha":0.2,"name":"leaky_re_lu_LeakyReLU9","trainable":true},"inbound_nodes":[[["dense_Dense13",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization10","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization10","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU9",0,0,{}]]]},{"name":"input6","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input6"},"inbound_nodes":[]},{"name":"dense_Dense14","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense14","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization10",0,0,{}]]]},{"name":"dense_Dense15","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense15","trainable":true},"inbound_nodes":[[["input6",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU10","class_name":"LeakyReLU","config":{"alpha":0.2,"name":"leaky_re_lu_LeakyReLU10","trainable":true},"inbound_nodes":[[["dense_Dense14",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU11","class_name":"LeakyReLU","config":{"alpha":0.2,"name":"leaky_re_lu_LeakyReLU11","trainable":true},"inbound_nodes":[[["dense_Dense15",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization11","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization11","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU10",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization12","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization12","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU11",0,0,{}]]]},{"name":"concatenate_Concatenate2","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate2","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization11",0,0,{}],["batch_normalization_BatchNormalization12",0,0,{}]]]},{"name":"dense_Dense16","class_name":"Dense","config":{"units":256,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense16","trainable":true},"inbound_nodes":[[["concatenate_Concatenate2",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU12","class_name":"LeakyReLU","config":{"alpha":0.2,"name":"leaky_re_lu_LeakyReLU12","trainable":true},"inbound_nodes":[[["dense_Dense16",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization13","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization13","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU12",0,0,{}]]]},{"name":"dense_Dense17","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense17","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization13",0,0,{}]]]},{"name":"activation_Activation2","class_name":"Activation","config":{"activation":"tanh","name":"activation_Activation2","trainable":true},"inbound_nodes":[[["dense_Dense17",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization14","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization14","trainable":true},"inbound_nodes":[[["activation_Activation2",0,0,{}]]]},{"name":"dense_Dense18","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization14",0,0,{}]]]}],"input_layers":[["input5",0,0],["input6",0,0]],"output_layers":[["dense_Dense18",0,0]]},"keras_version":"tfjs-layers 4.20.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.20.0","convertedBy":null,"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense13/kernel","shape":[3,128],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense14/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense14/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense15/kernel","shape":[1,128],"dtype":"float32"},{"name":"dense_Dense15/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/beta","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization12/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization12/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense16/kernel","shape":[192,256],"dtype":"float32"},{"name":"dense_Dense16/bias","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/beta","shape":[256],"dtype":"float32"},{"name":"dense_Dense17/kernel","shape":[256,64],"dtype":"float32"},{"name":"dense_Dense17/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense18/kernel","shape":[64,1],"dtype":"float32"},{"name":"dense_Dense18/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization12/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization12/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/moving_variance","shape":[64],"dtype":"float32"}]}]}