{"modelTopology":{"class_name":"Model","config":{"name":"model4","layers":[{"name":"input5","class_name":"InputLayer","config":{"batch_input_shape":[null,96,96,3],"dtype":"float32","sparse":false,"name":"input5"},"inbound_nodes":[]},{"name":"separable_conv2d_SeparableConv2D7","class_name":"SeparableConv2D","config":{"filters":32,"kernel_size":[5,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D7","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null},"inbound_nodes":[[["input5",0,0,{}]]]},{"name":"p_re_lu_PReLU16","class_name":"PReLU","config":{"alpha_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"alpha_regularizer":null,"alpha_constraint":null,"shared_axes":null,"name":"p_re_lu_PReLU16","trainable":true},"inbound_nodes":[[["separable_conv2d_SeparableConv2D7",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D7","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D7","trainable":true},"inbound_nodes":[[["p_re_lu_PReLU16",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization16","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization16","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D7",0,0,{}]]]},{"name":"separable_conv2d_SeparableConv2D8","class_name":"SeparableConv2D","config":{"filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D8","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null},"inbound_nodes":[[["batch_normalization_BatchNormalization16",0,0,{}]]]},{"name":"p_re_lu_PReLU17","class_name":"PReLU","config":{"alpha_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"alpha_regularizer":null,"alpha_constraint":null,"shared_axes":null,"name":"p_re_lu_PReLU17","trainable":true},"inbound_nodes":[[["separable_conv2d_SeparableConv2D8",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D8","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D8","trainable":true},"inbound_nodes":[[["p_re_lu_PReLU17",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization17","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization17","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D8",0,0,{}]]]},{"name":"flatten_Flatten4","class_name":"Flatten","config":{"name":"flatten_Flatten4","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization17",0,0,{}]]]},{"name":"dense_Dense13","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true},"inbound_nodes":[[["flatten_Flatten4",0,0,{}]]]},{"name":"p_re_lu_PReLU18","class_name":"PReLU","config":{"alpha_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"alpha_regularizer":null,"alpha_constraint":null,"shared_axes":null,"name":"p_re_lu_PReLU18","trainable":true},"inbound_nodes":[[["dense_Dense13",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization18","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization18","trainable":true},"inbound_nodes":[[["p_re_lu_PReLU18",0,0,{}]]]},{"name":"input6","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input6"},"inbound_nodes":[]},{"name":"dense_Dense14","class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense14","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization18",0,0,{}]]]},{"name":"dense_Dense15","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense15","trainable":true},"inbound_nodes":[[["input6",0,0,{}]]]},{"name":"p_re_lu_PReLU19","class_name":"PReLU","config":{"alpha_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"alpha_regularizer":null,"alpha_constraint":null,"shared_axes":null,"name":"p_re_lu_PReLU19","trainable":true},"inbound_nodes":[[["dense_Dense14",0,0,{}]]]},{"name":"p_re_lu_PReLU20","class_name":"PReLU","config":{"alpha_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"alpha_regularizer":null,"alpha_constraint":null,"shared_axes":null,"name":"p_re_lu_PReLU20","trainable":true},"inbound_nodes":[[["dense_Dense15",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization19","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization19","trainable":true},"inbound_nodes":[[["p_re_lu_PReLU19",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization20","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization20","trainable":true},"inbound_nodes":[[["p_re_lu_PReLU20",0,0,{}]]]},{"name":"concatenate_Concatenate2","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate2","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization19",0,0,{}],["batch_normalization_BatchNormalization20",0,0,{}]]]},{"name":"dense_Dense16","class_name":"Dense","config":{"units":256,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense16","trainable":true},"inbound_nodes":[[["concatenate_Concatenate2",0,0,{}]]]},{"name":"p_re_lu_PReLU21","class_name":"PReLU","config":{"alpha_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"alpha_regularizer":null,"alpha_constraint":null,"shared_axes":null,"name":"p_re_lu_PReLU21","trainable":true},"inbound_nodes":[[["dense_Dense16",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization21","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization21","trainable":true},"inbound_nodes":[[["p_re_lu_PReLU21",0,0,{}]]]},{"name":"dense_Dense17","class_name":"Dense","config":{"units":256,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense17","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization21",0,0,{}]]]},{"name":"p_re_lu_PReLU22","class_name":"PReLU","config":{"alpha_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"alpha_regularizer":null,"alpha_constraint":null,"shared_axes":null,"name":"p_re_lu_PReLU22","trainable":true},"inbound_nodes":[[["dense_Dense17",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization22","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization22","trainable":true},"inbound_nodes":[[["p_re_lu_PReLU22",0,0,{}]]]},{"name":"dense_Dense18","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization22",0,0,{}]]]}],"input_layers":[["input5",0,0],["input6",0,0]],"output_layers":[["dense_Dense18",0,0]]},"keras_version":"tfjs-layers 4.20.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.20.0","convertedBy":null,"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"separable_conv2d_SeparableConv2D7/depthwise_kernel","shape":[5,5,3,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D7/pointwise_kernel","shape":[1,1,3,32],"dtype":"float32"},{"name":"p_re_lu_PReLU16/alpha","shape":[96,96,32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/beta","shape":[32],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D8/depthwise_kernel","shape":[3,3,32,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D8/pointwise_kernel","shape":[1,1,32,64],"dtype":"float32"},{"name":"p_re_lu_PReLU17/alpha","shape":[48,48,64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization17/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization17/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense13/kernel","shape":[36864,64],"dtype":"float32"},{"name":"p_re_lu_PReLU18/alpha","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization18/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization18/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense14/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense15/kernel","shape":[3,64],"dtype":"float32"},{"name":"p_re_lu_PReLU19/alpha","shape":[32],"dtype":"float32"},{"name":"p_re_lu_PReLU20/alpha","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization19/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization19/beta","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization20/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization20/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense16/kernel","shape":[96,256],"dtype":"float32"},{"name":"p_re_lu_PReLU21/alpha","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization21/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization21/beta","shape":[256],"dtype":"float32"},{"name":"dense_Dense17/kernel","shape":[256,256],"dtype":"float32"},{"name":"p_re_lu_PReLU22/alpha","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization22/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization22/beta","shape":[256],"dtype":"float32"},{"name":"dense_Dense18/kernel","shape":[256,1],"dtype":"float32"},{"name":"dense_Dense18/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization17/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization17/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization18/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization18/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization19/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization19/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization20/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization20/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization21/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization21/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization22/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization22/moving_variance","shape":[256],"dtype":"float32"}]}]}