{"modelTopology":{"class_name":"Model","config":{"name":"model4","layers":[{"name":"input6","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input6"},"inbound_nodes":[]},{"name":"dense_Dense16","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense16","trainable":true},"inbound_nodes":[[["input6",0,0,{}]]]},{"name":"dense_Dense17","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense17","trainable":true},"inbound_nodes":[[["dense_Dense16",0,0,{}]]]},{"name":"dense_Dense18","class_name":"Dense","config":{"units":1,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.003,"maxval":0.003,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18","trainable":true},"inbound_nodes":[[["dense_Dense17",0,0,{}]]]}],"input_layers":[["input6",0,0]],"output_layers":[["dense_Dense18",0,0]]},"keras_version":"tfjs-layers 4.20.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.20.0","convertedBy":null,"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense16/kernel","shape":[3,256],"dtype":"float32"},{"name":"dense_Dense16/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense17/kernel","shape":[256,128],"dtype":"float32"},{"name":"dense_Dense17/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense18/kernel","shape":[128,1],"dtype":"float32"},{"name":"dense_Dense18/bias","shape":[1],"dtype":"float32"}]}]}