{
    "modelTopology": {
        "class_name": "Model",
        "config": {
            "name": "model3",
            "layers": [
                {
                    "name": "input4",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            96,
                            96,
                            3
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "name": "input4"
                    },
                    "inbound_nodes": []
                },
                {
                    "name": "separable_conv2d_SeparableConv2D5",
                    "class_name": "SeparableConv2D",
                    "config": {
                        "filters": 32,
                        "kernel_size": [
                            5,
                            5
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "linear",
                        "use_bias": false,
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "name": "separable_conv2d_SeparableConv2D5",
                        "trainable": true,
                        "depthwise_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "pointwise_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "depthwise_regularizer": null,
                        "pointwise_regularizer": null,
                        "depthwise_constraint": null,
                        "pointwise_constraint": null
                    },
                    "inbound_nodes": [
                        [
                            [
                                "input4",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "p_re_lu_PReLU12",
                    "class_name": "PReLU",
                    "config": {
                        "alpha_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "alpha_regularizer": null,
                        "alpha_constraint": null,
                        "shared_axes": null,
                        "name": "p_re_lu_PReLU12",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "separable_conv2d_SeparableConv2D5",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "max_pooling2d_MaxPooling2D5",
                    "class_name": "MaxPooling2D",
                    "config": {
                        "pool_size": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "strides": [
                            2,
                            2
                        ],
                        "data_format": "channels_last",
                        "name": "max_pooling2d_MaxPooling2D5",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "p_re_lu_PReLU12",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "batch_normalization_BatchNormalization12",
                    "class_name": "BatchNormalization",
                    "config": {
                        "axis": -1,
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "gamma_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "moving_mean_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "moving_variance_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null,
                        "name": "batch_normalization_BatchNormalization12",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "max_pooling2d_MaxPooling2D5",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "separable_conv2d_SeparableConv2D6",
                    "class_name": "SeparableConv2D",
                    "config": {
                        "filters": 64,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "linear",
                        "use_bias": false,
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "bias_constraint": null,
                        "name": "separable_conv2d_SeparableConv2D6",
                        "trainable": true,
                        "depthwise_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "pointwise_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "depthwise_regularizer": null,
                        "pointwise_regularizer": null,
                        "depthwise_constraint": null,
                        "pointwise_constraint": null
                    },
                    "inbound_nodes": [
                        [
                            [
                                "batch_normalization_BatchNormalization12",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "p_re_lu_PReLU13",
                    "class_name": "PReLU",
                    "config": {
                        "alpha_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "alpha_regularizer": null,
                        "alpha_constraint": null,
                        "shared_axes": null,
                        "name": "p_re_lu_PReLU13",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "separable_conv2d_SeparableConv2D6",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "max_pooling2d_MaxPooling2D6",
                    "class_name": "MaxPooling2D",
                    "config": {
                        "pool_size": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "strides": [
                            2,
                            2
                        ],
                        "data_format": "channels_last",
                        "name": "max_pooling2d_MaxPooling2D6",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "p_re_lu_PReLU13",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "batch_normalization_BatchNormalization13",
                    "class_name": "BatchNormalization",
                    "config": {
                        "axis": -1,
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "gamma_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "moving_mean_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "moving_variance_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null,
                        "name": "batch_normalization_BatchNormalization13",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "max_pooling2d_MaxPooling2D6",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "flatten_Flatten3",
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_Flatten3",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "batch_normalization_BatchNormalization13",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "dense_Dense10",
                    "class_name": "Dense",
                    "config": {
                        "units": 64,
                        "activation": "linear",
                        "use_bias": false,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_Dense10",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "flatten_Flatten3",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "p_re_lu_PReLU14",
                    "class_name": "PReLU",
                    "config": {
                        "alpha_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "alpha_regularizer": null,
                        "alpha_constraint": null,
                        "shared_axes": null,
                        "name": "p_re_lu_PReLU14",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "dense_Dense10",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "batch_normalization_BatchNormalization14",
                    "class_name": "BatchNormalization",
                    "config": {
                        "axis": -1,
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "gamma_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "moving_mean_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "moving_variance_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null,
                        "name": "batch_normalization_BatchNormalization14",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "p_re_lu_PReLU14",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "dense_Dense11",
                    "class_name": "Dense",
                    "config": {
                        "units": 32,
                        "activation": "linear",
                        "use_bias": false,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_Dense11",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "batch_normalization_BatchNormalization14",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "p_re_lu_PReLU15",
                    "class_name": "PReLU",
                    "config": {
                        "alpha_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "alpha_regularizer": null,
                        "alpha_constraint": null,
                        "shared_axes": null,
                        "name": "p_re_lu_PReLU15",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "dense_Dense11",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "batch_normalization_BatchNormalization15",
                    "class_name": "BatchNormalization",
                    "config": {
                        "axis": -1,
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "gamma_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "moving_mean_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "moving_variance_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null,
                        "name": "batch_normalization_BatchNormalization15",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "p_re_lu_PReLU15",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "dense_Dense12",
                    "class_name": "Dense",
                    "config": {
                        "units": 3,
                        "activation": "tanh",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "RandomUniform",
                            "config": {
                                "minval": -0.003,
                                "maxval": 0.003,
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_Dense12",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "batch_normalization_BatchNormalization15",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                }
            ],
            "input_layers": [
                [
                    "input4",
                    0,
                    0
                ]
            ],
            "output_layers": [
                [
                    "dense_Dense12",
                    0,
                    0
                ]
            ]
        },
        "keras_version": "tfjs-layers 4.20.0",
        "backend": "tensor_flow.js"
    },
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v4.20.0",
    "convertedBy": null,
    "weightsManifest": [
        {
            "paths": [
                "./model.weights.bin"
            ],
            "weights": [
                {
                    "name": "separable_conv2d_SeparableConv2D5/depthwise_kernel",
                    "shape": [
                        5,
                        5,
                        3,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "separable_conv2d_SeparableConv2D5/pointwise_kernel",
                    "shape": [
                        1,
                        1,
                        3,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "p_re_lu_PReLU12/alpha",
                    "shape": [
                        96,
                        96,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_BatchNormalization12/gamma",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_BatchNormalization12/beta",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "separable_conv2d_SeparableConv2D6/depthwise_kernel",
                    "shape": [
                        3,
                        3,
                        32,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "separable_conv2d_SeparableConv2D6/pointwise_kernel",
                    "shape": [
                        1,
                        1,
                        32,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "p_re_lu_PReLU13/alpha",
                    "shape": [
                        48,
                        48,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_BatchNormalization13/gamma",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_BatchNormalization13/beta",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense10/kernel",
                    "shape": [
                        36864,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "p_re_lu_PReLU14/alpha",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_BatchNormalization14/gamma",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_BatchNormalization14/beta",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense11/kernel",
                    "shape": [
                        64,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "p_re_lu_PReLU15/alpha",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_BatchNormalization15/gamma",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_BatchNormalization15/beta",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense12/kernel",
                    "shape": [
                        32,
                        3
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense12/bias",
                    "shape": [
                        3
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_BatchNormalization12/moving_mean",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_BatchNormalization12/moving_variance",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_BatchNormalization13/moving_mean",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_BatchNormalization13/moving_variance",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_BatchNormalization14/moving_mean",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_BatchNormalization14/moving_variance",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_BatchNormalization15/moving_mean",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_BatchNormalization15/moving_variance",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}