{"modelTopology":{"class_name":"Model","config":{"name":"model3","layers":[{"name":"input4","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input4"},"inbound_nodes":[]},{"name":"dense_Dense10","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10","trainable":true},"inbound_nodes":[[["input4",0,0,{}]]]},{"name":"input5","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input5"},"inbound_nodes":[]},{"name":"dense_Dense11","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true},"inbound_nodes":[[["dense_Dense10",0,0,{}]]]},{"name":"dense_Dense12","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true},"inbound_nodes":[[["input5",0,0,{}]]]},{"name":"concatenate_Concatenate2","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate2","trainable":true},"inbound_nodes":[[["dense_Dense11",0,0,{}],["dense_Dense12",0,0,{}]]]},{"name":"dense_Dense13","class_name":"Dense","config":{"units":512,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true},"inbound_nodes":[[["concatenate_Concatenate2",0,0,{}]]]},{"name":"dense_Dense14","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense14","trainable":true},"inbound_nodes":[[["dense_Dense13",0,0,{}]]]},{"name":"dense_Dense15","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense15","trainable":true},"inbound_nodes":[[["dense_Dense14",0,0,{}]]]}],"input_layers":[["input4",0,0],["input5",0,0]],"output_layers":[["dense_Dense15",0,0]]},"keras_version":"tfjs-layers 4.20.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.20.0","convertedBy":null,"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense10/kernel","shape":[3,256],"dtype":"float32"},{"name":"dense_Dense10/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense11/kernel","shape":[256,128],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense12/kernel","shape":[1,256],"dtype":"float32"},{"name":"dense_Dense12/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense13/kernel","shape":[384,512],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense14/kernel","shape":[512,128],"dtype":"float32"},{"name":"dense_Dense14/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense15/kernel","shape":[128,1],"dtype":"float32"},{"name":"dense_Dense15/bias","shape":[1],"dtype":"float32"}]}]}