{"modelTopology":{"class_name":"Model","config":{"name":"model6","layers":[{"name":"input9","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input9"},"inbound_nodes":[]},{"name":"dense_Dense25","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense25","trainable":true},"inbound_nodes":[[["input9",0,0,{}]]]},{"name":"input10","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input10"},"inbound_nodes":[]},{"name":"dense_Dense26","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense26","trainable":true},"inbound_nodes":[[["dense_Dense25",0,0,{}]]]},{"name":"dense_Dense27","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense27","trainable":true},"inbound_nodes":[[["input10",0,0,{}]]]},{"name":"concatenate_Concatenate4","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate4","trainable":true},"inbound_nodes":[[["dense_Dense26",0,0,{}],["dense_Dense27",0,0,{}]]]},{"name":"dense_Dense28","class_name":"Dense","config":{"units":512,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense28","trainable":true},"inbound_nodes":[[["concatenate_Concatenate4",0,0,{}]]]},{"name":"dense_Dense29","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense29","trainable":true},"inbound_nodes":[[["dense_Dense28",0,0,{}]]]},{"name":"dense_Dense30","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense30","trainable":true},"inbound_nodes":[[["dense_Dense29",0,0,{}]]]}],"input_layers":[["input9",0,0],["input10",0,0]],"output_layers":[["dense_Dense30",0,0]]},"keras_version":"tfjs-layers 4.20.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.20.0","convertedBy":null,"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense25/kernel","shape":[3,256],"dtype":"float32"},{"name":"dense_Dense25/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense26/kernel","shape":[256,128],"dtype":"float32"},{"name":"dense_Dense26/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense27/kernel","shape":[1,256],"dtype":"float32"},{"name":"dense_Dense27/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense28/kernel","shape":[384,512],"dtype":"float32"},{"name":"dense_Dense28/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense29/kernel","shape":[512,128],"dtype":"float32"},{"name":"dense_Dense29/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense30/kernel","shape":[128,1],"dtype":"float32"},{"name":"dense_Dense30/bias","shape":[1],"dtype":"float32"}]}]}